In [82]:
import pandas as pd

In [84]:
#reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [86]:
#adding a new column 
#1. assing()
#   when to use assing ?
#* add multiple columns in a single line of code 
#* When you need to overwrite the values of an existing columns (best practice)

#it returns a new object (a copy) with all the original columns in addition to the new ones'''

In [88]:
import numpy as np

In [90]:
#create random numbers for our new score columns 
score1 = np.random.randint(1, 100, size=1000)
score2 = np.random.randint(1, 100, size=1000)

In [92]:
# create a series using the random numbers
series1 = pd.Series(score1, index=np.arange(0, 1000))
series2 = pd.Series(score2, index=np.arange(0, 1000))

In [94]:

series1

0      43
1      15
2      60
3      88
4      86
       ..
995    78
996    30
997    56
998    52
999    76
Length: 1000, dtype: int32

In [96]:
#using assign() to add multiple columns
df_exams.assign(score1=series1, score2=series2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,43,58
1,female,group C,some college,standard,completed,69,90,88,15,25
2,female,group B,master's degree,standard,none,90,95,93,60,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,88,57
4,male,group C,some college,standard,none,76,78,75,86,53
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,78,15
996,male,group C,high school,free/reduced,none,62,55,55,30,19
997,female,group C,high school,free/reduced,completed,59,71,65,56,3
998,female,group D,some college,standard,completed,68,78,77,52,36
999,female,group D,some college,free/reduced,none,77,86,86,76,88

In [98]:
#using assign() to add multiple columns
df_exams = df_exams.assign(score1=series1, score2=series2) #for updating over here dataframe

In [100]:
# show dataframe
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,43,58
1,female,group C,some college,standard,completed,69,90,88,15,25
2,female,group B,master's degree,standard,none,90,95,93,60,2
3,male,group A,associate's degree,free/reduced,none,47,57,44,88,57
4,male,group C,some college,standard,none,76,78,75,86,53
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,78,15
996,male,group C,high school,free/reduced,none,62,55,55,30,19
997,female,group C,high school,free/reduced,completed,59,71,65,56,3
998,female,group D,some college,standard,completed,68,78,77,52,36
999,female,group D,some college,free/reduced,none,77,86,86,76,88

In [102]:
#insert
#using index() to add column at a specific position
df_exams.insert(1, 'test', series1)

In [104]:
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2
0,female,43,group B,bachelor's degree,standard,none,72,72,74,43,58
1,female,15,group C,some college,standard,completed,69,90,88,15,25
2,female,60,group B,master's degree,standard,none,90,95,93,60,2
3,male,88,group A,associate's degree,free/reduced,none,47,57,44,88,57
4,male,86,group C,some college,standard,none,76,78,75,86,53
...,...,...,...,...,...,...,...,...,...,...,...
995,female,78,group E,master's degree,standard,completed,88,99,95,78,15
996,male,30,group C,high school,free/reduced,none,62,55,55,30,19
997,female,56,group C,high school,free/reduced,completed,59,71,65,56,3
998,female,52,group D,some college,standard,completed,68,78,77,52,36
999,female,76,group D,some college,free/reduced,none,77,86,86,76,88

In [106]:
#Math Operations

In [108]:
#operations in columns
#select a column and calculate total sum
df_exams['math score'].sum()

66089

In [110]:
#count, mean, std, max, and min
df_exams['math score'].count()
df_exams['math score'].mean()
df_exams['math score'].std()
df_exams['math score'].min()
df_exams['math score'].max()

100

In [112]:
# easier calculating with .describe()
df_exams.describe()

,test,math score,reading score,writing score,score1,score2
count,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000
mean,50.762000,66.08900,69.169000,68.054000,50.762000,48.255000
std,28.819436,15.16308,14.600192,15.195657,28.819436,28.980577
min,1.000000,0.00000,17.000000,10.000000,1.000000,1.000000
25%,25.000000,57.00000,59.000000,57.750000,25.000000,23.000000
50%,52.000000,66.00000,70.000000,69.000000,52.000000,46.500000
75%,76.000000,77.00000,79.000000,79.000000,76.000000,72.000000
max,99.000000,100.00000,100.000000,100.000000,99.000000,99.000000

In [114]:
#operations inn rows
#calculating the sum in a row 
df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [116]:
#calculating the average score and assigning the result to a new column
df_exams['average'] = (df_exams['math score'] + df_exams['reading score'] + df_exams['writing score'])

df_exams

In [119]:
#value counts 
#counting gender elements 
#len function 
len(df_exams['gender'])
# .count() method
df_exams['gender'].count()

1000

In [121]:
#counting gender elements by category
df_exams['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [123]:
#return the relative frequency (divide all values by the sum of values)
df_exams['gender'].value_counts(normalize=True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [125]:
# counting "parental level of education" elements by category 
df_exams['parental level of education'].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [127]:
# return the relative frequency and round to 2 decimals
df_exams['parental level of education'].value_counts(normalize=True)

parental level of education
some college          0.226
associate's degree    0.222
high school           0.196
some high school      0.179
bachelor's degree     0.118
master's degree       0.059
Name: proportion, dtype: float64

In [129]:
#Sort a dataframe

In [131]:
# sort by one column
df_exams.sort_values('math score')

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
59,female,41,group C,some high school,free/reduced,none,0,17,10,41,58,27
980,female,19,group B,high school,free/reduced,none,8,24,23,19,34,55
17,female,69,group B,some high school,free/reduced,none,18,32,28,69,30,78
787,female,66,group B,some college,standard,none,19,38,32,66,80,89
145,female,92,group C,some college,free/reduced,none,22,39,33,92,72,94
...,...,...,...,...,...,...,...,...,...,...,...,...
625,male,15,group D,some college,standard,completed,100,97,99,15,30,296
623,male,67,group A,some college,standard,completed,100,96,86,67,23,282
451,female,2,group E,some college,standard,none,100,92,97,2,63,289
962,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300
149,male,90,group E,associate's degree,free/reduced,completed,100,100,93,90,70,293

In [133]:
#sort descending by one column
df_exams.sort_values('math score', ascending=False)

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
962,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300
625,male,15,group D,some college,standard,completed,100,97,99,15,30,296
458,female,38,group E,bachelor's degree,standard,none,100,100,100,38,59,300
623,male,67,group A,some college,standard,completed,100,96,86,67,23,282
451,female,2,group E,some college,standard,none,100,92,97,2,63,289
...,...,...,...,...,...,...,...,...,...,...,...,...
145,female,92,group C,some college,free/reduced,none,22,39,33,92,72,94
787,female,66,group B,some college,standard,none,19,38,32,66,80,89
17,female,69,group B,some high school,free/reduced,none,18,32,28,69,30,78
980,female,19,group B,high school,free/reduced,none,8,24,23,19,34,55
59,female,41,group C,some high school,free/reduced,none,0,17,10,41,58,27

In [135]:
#sort descending by multiple columns
df_exams.sort_values(['math score', 'reading score'], ascending=False)

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
149,male,90,group E,associate's degree,free/reduced,completed,100,100,93,90,70,293
458,female,38,group E,bachelor's degree,standard,none,100,100,100,38,59,300
916,male,92,group E,bachelor's degree,standard,completed,100,100,100,92,17,300
962,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300
625,male,15,group D,some college,standard,completed,100,97,99,15,30,296
...,...,...,...,...,...,...,...,...,...,...,...,...
145,female,92,group C,some college,free/reduced,none,22,39,33,92,72,94
787,female,66,group B,some college,standard,none,19,38,32,66,80,89
17,female,69,group B,some high school,free/reduced,none,18,32,28,69,30,78
980,female,19,group B,high school,free/reduced,none,8,24,23,19,34,55
59,female,41,group C,some high school,free/reduced,none,0,17,10,41,58,27

In [137]:
#sort descending by multiple columns and update dataframe  , for the just copy we use inplace bt for the update go wt the =True 
df_exams.sort_values(['math score', 'reading score'], ascending=False,
                    inplace=True)

In [139]:
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
149,male,90,group E,associate's degree,free/reduced,completed,100,100,93,90,70,293
458,female,38,group E,bachelor's degree,standard,none,100,100,100,38,59,300
916,male,92,group E,bachelor's degree,standard,completed,100,100,100,92,17,300
962,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300
625,male,15,group D,some college,standard,completed,100,97,99,15,30,296
...,...,...,...,...,...,...,...,...,...,...,...,...
145,female,92,group C,some college,free/reduced,none,22,39,33,92,72,94
787,female,66,group B,some college,standard,none,19,38,32,66,80,89
17,female,69,group B,some high school,free/reduced,none,18,32,28,69,30,78
980,female,19,group B,high school,free/reduced,none,8,24,23,19,34,55
59,female,41,group C,some high school,free/reduced,none,0,17,10,41,58,27

In [141]:
# sort descending with a key fun
df_exams.sort_values('race/ethnicity', ascending=True,
                    key=lambda col:col.str.lower())

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
741,female,53,group A,associate's degree,free/reduced,none,37,57,56,53,50,150
151,male,79,group A,bachelor's degree,standard,none,77,67,68,79,61,212
811,male,37,group A,high school,free/reduced,none,45,47,49,37,33,141
112,male,62,group A,associate's degree,standard,none,54,53,47,62,78,154
25,male,96,group A,master's degree,free/reduced,none,73,74,72,96,61,219
...,...,...,...,...,...,...,...,...,...,...,...,...
751,male,36,group E,some college,standard,none,68,72,65,36,68,205
915,female,66,group E,some college,standard,none,68,70,66,66,10,204
592,male,93,group E,bachelor's degree,standard,none,68,68,64,93,19,200
479,male,19,group E,associate's degree,standard,none,76,71,67,19,9,214
517,female,31,group E,some college,standard,completed,66,74,73,31,73,213

In [143]:
# create Index

In [145]:
import numpy as np
import random

In [147]:
#creating non repetitive values for the index
np.arange(0, 1000)

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194,
       195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207,
       208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220,
       221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233,
       234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246,
       247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259,
       260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272,
       273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285,
       286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298,
       299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311,
       312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324,
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337,
       338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350,
       351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363,
       364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376,
       377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389,
       390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402,
       403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415,
       416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428,
       429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441,
       442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454,
       455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467,
       468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480,
       481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493,
       494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506,
       507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519,
       520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532,
       533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545,
       546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558,
       559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571,
       572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584,
       585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597,
       598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610,
       611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623,
       624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636,
       637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649,
       650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662,
       663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675,
       676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688,
       689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 700, 701,
       702, 703, 704, 705, 706, 707, 708, 709, 710, 711, 712, 713, 714,
       715, 716, 717, 718, 719, 720, 721, 722, 723, 724, 725, 726, 727,
       728, 729, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 740,
       741, 742, 743, 744, 745, 746, 747, 748, 749, 750, 751, 752, 753,
       754, 755, 756, 757, 758, 759, 760, 761, 762, 763, 764, 765, 766,
       767, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779,
       780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792,
       793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805,
       806, 807, 808, 809, 810, 811, 812, 813, 814, 815, 816, 817, 818,
       819, 820, 821, 822, 823, 824, 825, 826, 827, 828, 829, 830, 831,
       832, 833, 834, 835, 836, 837, 838, 839, 840, 841, 842, 843, 844,
       845, 846, 847, 848, 849, 850, 851, 852, 853, 854, 855, 856, 857,
       858, 859, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 870,
       871, 872, 873, 874, 875, 876, 877, 878, 879, 880, 881, 882, 883,
       884, 885, 886, 887, 888, 889, 890, 891, 892, 893, 894, 895, 896,
       897, 898, 899, 900, 901, 902, 903, 904, 905, 906, 907, 908, 909,
       910, 911, 912, 913, 914, 915, 916, 917, 918, 919, 920, 921, 922,
       923, 924, 925, 926, 927, 928, 929, 930, 931, 932, 933, 934, 935,
       936, 937, 938, 939, 940, 941, 942, 943, 944, 945, 946, 947, 948,
       949, 950, 951, 952, 953, 954, 955, 956, 957, 958, 959, 960, 961,
       962, 963, 964, 965, 966, 967, 968, 969, 970, 971, 972, 973, 974,
       975, 976, 977, 978, 979, 980, 981, 982, 983, 984, 985, 986, 987,
       988, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998, 999])

In [149]:
new_index = np.arange(0, 1000)

In [151]:
# shuffling the indexes
random.shuffle(new_index)

In [153]:
new_index

array([132, 988, 364, 999, 236, 498, 671, 669, 296, 354, 658, 989, 688,
       103, 120, 474, 679,  23, 429, 583, 736, 885, 112, 585, 836, 611,
       465, 394, 197, 482, 536, 376,  44, 632,  89, 483, 207, 607, 484,
       377,  13, 952, 951, 216,   6, 990, 302, 521, 893, 329, 259, 372,
       627, 183, 597, 800, 682, 184, 164, 125, 211,  72, 506,   7, 316,
       522, 328, 161, 759, 700, 402, 725, 856, 687,  53, 146, 423, 404,
       635, 681, 846, 213, 755, 790, 432, 570, 167, 126, 606, 343, 424,
       473, 281,  88, 808, 554,  58, 557, 532, 515, 810, 265, 973, 933,
       694, 771, 762, 128, 631, 240, 970, 154, 260, 365, 141, 419, 528,
       471, 645, 859, 416, 264, 543, 454, 843, 817, 646, 921, 417, 345,
       816, 702, 749, 534, 485, 173, 427, 261, 617, 100, 555, 948, 929,
       912, 770, 789, 491, 541, 227, 244, 383, 195, 321, 913, 955, 106,
       510, 317, 648, 569, 228, 456, 964, 200, 891, 822, 644, 273, 438,
       451, 596, 326, 351, 778,  91, 412, 415, 818, 609, 276, 440, 712,
       675, 805, 352, 178, 194, 814, 552, 899, 905, 294, 828, 223, 922,
       610, 425, 888, 340, 370, 994,  31, 347, 559, 587, 248, 174, 327,
       639, 358, 598,  87, 310, 374, 761, 991, 839, 205, 878,  32, 722,
       495,  55, 823, 793, 975,  77, 221, 784, 678, 177, 923, 457, 172,
       660, 478, 300, 524, 977, 706, 538, 797, 502, 730, 218, 533, 486,
       353, 684, 274, 335, 462, 206, 748, 375, 143, 355, 998, 420, 588,
       900, 380, 727, 504, 514, 527, 150,  36, 640, 777, 494, 629, 780,
       969, 651, 986, 852, 545, 799, 136, 530,  34, 241, 571, 733, 902,
       109, 160, 667, 162,  27, 217, 243, 634, 444, 883, 309, 282, 312,
       683,  71, 219, 408, 479, 965, 224, 553, 906,  11, 431, 686, 696,
       796, 622,   5, 288, 210, 584, 468, 849, 286, 844, 384, 717, 121,
       872, 366, 542, 140, 661,  80, 924,  33, 787, 251, 600,  18,  49,
       113, 330, 720,  35, 176, 701,  76,  83,  17, 360, 620,  79, 940,
       577, 612, 886,  12, 156, 942, 978, 590,  98, 626, 672, 123, 864,
       315, 239, 766, 768, 604, 907, 131, 708,  62, 373, 367, 938, 869,
       728, 838, 268, 877, 732, 668,  70, 466, 809, 513, 179, 381, 939,
       400, 652, 963, 501, 272, 165, 266, 757, 765, 958, 713, 387, 509,
       301, 625, 850, 497, 459, 463, 256, 255, 406,   4, 308, 152, 595,
       547, 624, 190, 572, 151, 615, 115, 967, 170, 662, 961, 724, 845,
       386, 304, 253, 158, 537, 455, 785, 703,  24, 356, 566, 551, 235,
       734, 371, 887, 411,  63, 673, 890, 362, 247, 960, 775, 803, 238,
       794, 871, 950, 804, 346, 643, 134, 114, 561, 698, 399, 976, 307,
       270, 147, 518, 153, 834, 962, 941, 578, 413, 469, 258, 117, 313,
       867, 879, 323, 824,  61,  52, 892,  41, 853, 391, 531,  20, 731,
       349, 155, 189, 549, 458, 786, 342, 764, 894, 453,  26, 835, 972,
       957, 237, 490, 711, 481, 275, 747, 558, 781, 357, 993, 517, 439,
       149, 133, 884, 718, 737,  15, 496, 337, 813, 926, 175, 550, 758,
       159, 594, 279, 917, 831, 709,  92, 971, 269, 198, 414, 738, 144,
        96,  39, 180, 245, 628, 621, 773, 670, 946, 318,  93, 653,  60,
       862, 428, 257, 774, 947,  30, 395, 305, 138, 166, 949, 388, 580,
       382, 865, 937, 449, 619, 825, 116,  42, 932, 392, 447, 230, 633,
       252, 336, 608, 833, 199, 443, 529, 763, 636, 589, 710, 320, 979,
       753, 492,  84, 560, 287, 437,  10, 568, 889, 767, 369, 405,   1,
       102,  86, 418,  54, 398, 806, 171, 854, 516, 830, 450, 122, 987,
       277, 187,  43, 225, 829, 203, 676,  65, 291, 826,  38, 769, 637,
       579, 231, 697, 848, 285, 368, 870, 693, 215, 707, 267,  51, 168,
       489, 212, 934, 863, 586, 647, 974, 716, 339, 861, 472, 334, 410,
       565, 704, 995, 229, 954, 232, 250, 910, 574, 931, 539, 927, 798,
       426, 746, 915, 575, 807, 480, 430, 182, 359, 169,  56, 331, 851,
       104, 148, 191, 452, 283, 548, 403, 691, 563,   2, 750, 801, 901,
       324, 341,  19, 129, 475, 857, 145, 821, 293, 202, 981, 108, 390,
       435, 591, 295, 448, 996, 124, 751, 656, 523, 847, 407, 876, 614,
       715,  47, 540, 201, 776, 254, 581,  22, 745, 397, 692, 930, 311,
       782, 292, 820,  99,   8, 567, 535,  75, 944, 110, 729,  69, 208,
       832, 752, 446, 719, 983, 322, 904, 119, 508, 562, 319, 630, 873,
       422, 338, 783, 956, 788, 613, 928, 680, 638, 573, 898, 556, 742,
       811,  78,  14, 935, 714, 655, 378, 827,  59, 866, 642, 401, 181,
       499,  45, 779, 756, 130, 163, 623, 271,  66, 618, 280, 685,  37,
       461, 916, 127, 385, 409,  68, 943,  97, 677, 664, 214, 118, 306,
       470, 263, 325, 650, 880, 654, 739, 546, 222, 303, 290, 914, 840,
       476,  90, 895, 500, 204, 802, 772, 982, 744, 882, 441, 111, 298,
        82, 815, 743, 874, 246, 881, 262, 980, 705, 233, 616, 421, 699,
       920,  46,  73, 348, 968, 467, 860,  57, 741, 139,  21, 908, 289,
       582, 137, 593, 605, 525, 959, 721, 649, 507, 389, 689, 919,  95,
       599, 396, 519, 911,  94, 663, 868, 674, 196, 966,  64, 503, 249,
       278, 192, 105, 903, 726,  81, 188, 592, 314, 918, 665,   3, 477,
       185, 284, 690, 984,  50, 363, 754, 234, 760, 511,  48, 791, 186,
       925, 564, 945, 659, 135, 520, 641, 855, 361, 434, 157, 896, 193,
       488, 332, 433, 841,  67,  29, 209, 445, 875, 333, 936, 657, 666,
       603,   0,  74,  28, 740, 601, 242, 723, 909, 493, 576, 142, 842,
       544, 837, 344, 735, 487, 795, 442,  16, 997, 505,  40, 858, 460,
       464, 819, 393, 350, 107, 297, 792, 985,   9, 512, 379, 602, 220,
       226, 897, 526,  25, 436, 299, 812, 992,  85, 695, 953, 101])

In [158]:
# create a new column with new index
df_exams['new_index'] = new_index
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average,new_index
149,male,90,group E,associate's degree,free/reduced,completed,100,100,93,90,70,293,132
458,female,38,group E,bachelor's degree,standard,none,100,100,100,38,59,300,988
916,male,92,group E,bachelor's degree,standard,completed,100,100,100,92,17,300,364
962,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300,999
625,male,15,group D,some college,standard,completed,100,97,99,15,30,296,236
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145,female,92,group C,some college,free/reduced,none,22,39,33,92,72,94,992
787,female,66,group B,some college,standard,none,19,38,32,66,80,89,85
17,female,69,group B,some high school,free/reduced,none,18,32,28,69,30,78,695
980,female,19,group B,high school,free/reduced,none,8,24,23,19,34,55,953
59,female,41,group C,some high school,free/reduced,none,0,17,10,41,58,27,101

In [160]:
# set new_index column as index 
df_exams.set_index('new_index')

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
new_index,,,,,,,,,,,,
132,male,90,group E,associate's degree,free/reduced,completed,100,100,93,90,70,293
988,female,38,group E,bachelor's degree,standard,none,100,100,100,38,59,300
364,male,92,group E,bachelor's degree,standard,completed,100,100,100,92,17,300
999,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300
236,male,15,group D,some college,standard,completed,100,97,99,15,30,296
...,...,...,...,...,...,...,...,...,...,...,...,...
992,female,92,group C,some college,free/reduced,none,22,39,33,92,72,94
85,female,66,group B,some college,standard,none,19,38,32,66,80,89
695,female,69,group B,some high school,free/reduced,none,18,32,28,69,30,78
953,female,19,group B,high school,free/reduced,none,8,24,23,19,34,55
101,female,41,group C,some high school,free/reduced,none,0,17,10,41,58,27

In [162]:
# set new_index column as index 
df_exams.set_index('new_index', inplace=True)
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
new_index,,,,,,,,,,,,
132,male,90,group E,associate's degree,free/reduced,completed,100,100,93,90,70,293
988,female,38,group E,bachelor's degree,standard,none,100,100,100,38,59,300
364,male,92,group E,bachelor's degree,standard,completed,100,100,100,92,17,300
999,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300
236,male,15,group D,some college,standard,completed,100,97,99,15,30,296
...,...,...,...,...,...,...,...,...,...,...,...,...
992,female,92,group C,some college,free/reduced,none,22,39,33,92,72,94
85,female,66,group B,some college,standard,none,19,38,32,66,80,89
695,female,69,group B,some high school,free/reduced,none,18,32,28,69,30,78
953,female,19,group B,high school,free/reduced,none,8,24,23,19,34,55
101,female,41,group C,some high school,free/reduced,none,0,17,10,41,58,27

In [164]:
# sort dataframe by new index
df_exams.sort_index()

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2,average
new_index,,,,,,,,,,,,
0,female,69,group D,some high school,free/reduced,completed,40,65,64,69,56,169
1,male,62,group C,master's degree,free/reduced,completed,62,68,75,62,1,205
2,female,89,group E,associate's degree,standard,none,59,62,69,89,27,190
3,female,41,group B,high school,free/reduced,completed,46,54,58,41,76,158
4,female,82,group A,some college,standard,none,69,84,82,82,75,235
...,...,...,...,...,...,...,...,...,...,...,...,...
995,female,9,group B,some high school,standard,completed,60,70,74,9,13,204
996,female,17,group B,high school,standard,none,58,62,59,17,26,179
997,female,99,group E,bachelor's degree,standard,none,37,45,38,99,42,120
998,male,82,group D,some college,standard,completed,76,83,79,82,13,238
999,female,8,group E,associate's degree,standard,none,100,100,100,8,99,300